analyze -format verilog ../rtl/ME_AB2/A.v
analyze -format verilog ../rtl/ME_AB2/AD.v
analyze -format verilog ../rtl/ME_AB2/AD_ARRAY.v
analyze -format verilog ../rtl/ME_AB2/ADD.v
analyze -format verilog ../rtl/ME_AB2/ADD_8.v
analyze -format verilog ../rtl/ME_AB2/CurBuffer.v
analyze -format verilog ../rtl/ME_AB2/FF.v
analyze -format verilog ../rtl/ME_AB2/FIFO.v
analyze -format verilog ../rtl/ME_AB2/FIFO_0.v
analyze -format verilog ../rtl/ME_AB2/FIFO_1to6.v
analyze -format verilog ../rtl/ME_AB2/FIFO_7.v
analyze -format verilog ../rtl/ME_AB2/FIFO_AD_ARRAY.v
analyze -format verilog ../rtl/ME_AB2/ME_input_buffer.v
analyze -format verilog ../rtl/ME_AB2/MIN.v
analyze -format verilog ../rtl/ME_AB2/MIN_16.v
analyze -format verilog ../rtl/ME_AB2/MIN_LEAF.v
analyze -format verilog ../rtl/ME_AB2/RefSRAM.v
analyze -format verilog ../rtl/ME_AB2/POST_PROCESSER.v
analyze -format verrilog ../rtl/ME_AB2/TIMER.v
analyze -format verilog ../rtl/ME_AB2/ME.v
analyze -format verilog ../rtl/ME_AB2/ME_chip.v
elaborate ME_chip



#analyze -format verilog ../rtl/idct/even_odd.v
#elaborate even_odd
#analyze -format verilog ../rtl/idct/idct4.v
#elaborate idct4
#analyze -format verilog ../rtl/idct/idct8.v
#elaborate idct8
#analyze -format verilog ../rtl/idct/idct_cal.v
#elaborate idct_cal
#analyze -format verilog ../rtl/idct/mem4x4.v
#elaborate mem4x4
#analyze -format verilog ../rtl/idct/mem8x8.v
#elaborate mem8x8
#analyze -format verilog ../rtl/idct/mem_ctrl_tran.v
#elaborate mem_ctrl_tran
#analyze -format verilog ../rtl/idct/p2s.v
#elaborate p2s
#analyze -format verilog ../rtl/idct/s2p.v
#elaborate s2p
#analyze -format verilog ../rtl/idct/idct.v
#elaborate idct
#analyze -format verilog ../rtl/idct/idct_chip.v
#elaborate idct_chip

#analyze -format verilog ../rtl/idct/even_odd.v

#analyze -format verilog ../rtl/idct/mem4x4.v
#analyze -format verilog ../rtl/idct/mem8x8.v
#analyze -format verilog ../rtl/idct/mem_ctrl_tran.v
#analyze -format verilog ../rtl/idct/p2s.v
#analyze -format verilog ../rtl/idct/s2p.v
#analyze -format verilog ../rtl/idct/idct4.v

#analyze -format verilog ../rtl/idct/idct8.v

#analyze -format verilog ../rtl/idct/idct_cal.v

#analyze -format verilog ../rtl/idct/idct.v
#analyze -format verilog ../rtl/idct/idct_chip.v
#elaborate idct_chip

#read_verilog ../rtl/idct/even_odd.v

#read_verilog ../rtl/idct/mem4x4.v
#read_verilog ../rtl/idct/mem8x8.v
#read_verilog ../rtl/idct/mem_ctrl_tran.v
#read_verilog ../rtl/idct/p2s.v
#read_verilog ../rtl/idct/s2p.v
#read_verilog ../rtl/idct/idct4.v

#read_verilog ../rtl/idct/idct8.v

#read_verilog ../rtl/idct/idct_cal.v

#read_verilog ../rtl/idct/idct.v
#read_verilog ../rtl/idct/idct_chip.v
